Revit 2024 API
BuiltInFailures.RoofFailures.RoofExceedsMaxHeight Property
 Roof exceeds user-specified maximum height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoofExceedsMaxHeight { get; }
Visual Basic
Public Shared ReadOnly Property RoofExceedsMaxHeight As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoofExceedsMaxHeight {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace